In [65]:
import pandas as pd
from sqlalchemy import create_engine
from db_sqlinfohw import pw
import pg8000

In [83]:
#rename DF to match CSV
clean_housing_zip=pd.read_csv('../CleanData/housing_by_zip.csv')

In [84]:
clean_housing_zip.head()

,Unnamed: 0,year,bank,tractrat,income,bocreditscore,ltv,amount,rate,zip,city
0,0,2016,Chicago,1.4676,51996,4,0.80,200000,0.040,36053,Midway
1,1,2016,Chicago,1.4676,51996,4,0.80,200000,0.040,36029,Fitzpatrick
2,2,2016,Chicago,1.4676,51996,4,0.80,200000,0.040,36089,Union Springs
3,3,2016,Atlanta,1.4135,164484,4,0.99,287100,0.035,36053,Midway
4,4,2016,Atlanta,1.4135,164484,4,0.99,287100,0.035,36029,Fitzpatrick

In [90]:
#Dropped unnamed column:

clean_housing_zip_df=clean_housing_zip.drop(['Unnamed: 0'],axis=1)

In [87]:
#DB slightly adjusted string to mask PW using .gitignore:

rds_connection_string = pw+'@localhost:5432/housing_db'
engine = create_engine(f'postgresql://{rds_connection_string}')

In [93]:
#Update DF name prior to loading
clean_housing_zip_df.to_sql(name='fhlb_housing_zip', con=engine, if_exists='replace', index=False)

In [6]:
pd.read_sql_query('select count(*) from zillow_db', con=engine).head()

   count
0  23307

In [10]:
zillow_2018_df=pd.read_csv('../CleanData/Zillow_2018avghomeval.csv')

In [11]:
zillow_2018_df.head()

,zipcode,city,state,metro,countyname,2018_avghomevalue
0,10065,New York,NY,New York-Newark-Jersey City,New York County,8779974
1,10075,New York,NY,New York-Newark-Jersey City,New York County,7859110
2,10021,New York,NY,New York-Newark-Jersey City,New York County,7397214
3,10128,New York,NY,New York-Newark-Jersey City,New York County,5937647
4,10014,New York,NY,New York-Newark-Jersey City,New York County,5687485

In [12]:
zillow_2018_df.to_sql(name='zillow_2018_db', con=engine, if_exists='append', index=False)

In [13]:
pd.read_sql_query('select count(*) from zillow_2018_db', con=engine).head()

   count
0  23307